   # Visual Data Analysis of Fraudulent Transactions

In [10]:
# initial imports
import pandas as pd
import calendar
import plotly.express as px
import hvplot.pandas
from sqlalchemy import create_engine

In [11]:
# create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/sql-homework-db")

In [21]:
# Define cardholder id list
cardholder_ids = [2,18]
cardholder_ids_str = str(cardholder_ids).replace('[', '(').replace(']', ')')
cardholder_ids_str

'(2, 18)'

   ## Data Analysis Questions 1

   Use `hvPlot` to create a line plot showing a time series from the transactions along all the year for **card holders 2 and 18**. In order to contrast the patterns of both card holders, create a line plot containing both lines. What difference do you observe between the consumption patterns? Does the difference could be a fraudulent transaction? Explain your rationale.

In [28]:
# loading data for card holder 2 and 18 from the database
query = f"""SELECT * 
    FROM credit_card as cc
    INNER JOIN transactions as t ON t.card  = cc.card
    INNER JOIN card_holder as ch ON ch.id = cc.id_card_holder
    WHERE cc.id_card_holder IN {cardholder_ids_str}
    """

transactions = pd.read_sql(query, engine)
transactions

,card,id_card_holder,id,date,amount,card,id_merchant,id,name
0,4498002758300,18,567,2018-01-01,2.95,4498002758300,64,18,Malik Carlson
1,344119623920892,18,2077,2018-01-05,1.36,344119623920892,30,18,Malik Carlson
2,4866761290278198714,2,2439,2018-01-06,1.33,4866761290278198714,127,2,Shane Shaffer
3,4866761290278198714,2,1867,2018-01-06,10.82,4866761290278198714,70,2,Shane Shaffer
4,344119623920892,18,3457,2018-01-07,175.00,344119623920892,12,18,Malik Carlson
...,...,...,...,...,...,...,...,...,...
227,344119623920892,18,1994,2018-12-27,1.70,344119623920892,55,18,Malik Carlson
228,4498002758300,18,114,2018-12-28,3.46,4498002758300,82,18,Malik Carlson
229,344119623920892,18,1228,2018-12-28,12.88,344119623920892,60,18,Malik Carlson
230,675911140852,2,962,2018-12-28,11.03,675911140852,2,2,Shane Shaffer
231,4498002758300,18,1218,2018-12-29,12.25,4498002758300,6,18,Malik Carlson

In [13]:
# plot for cardholder 2

In [14]:
# plot for cardholder 18

In [15]:
# combined plot for card holders 2 and 18

   ### Conclusions for Question 1

   ## Data Analysis Question 2

   Use `Plotly Express` to create a series of six box plots, one for each month, in order to identify how many outliers could be per month for **card holder id 25**. By observing the consumption patters, do you see any anomalies? Write your own conclusions about your insights.

In [16]:
# loading data of daily transactions from jan to jun 2018 for card holder 25

In [17]:
# change the numeric month to month names

In [18]:
# creating the six box plots using plotly express

   ### Conclusions for Question 2